/*
---------===== ПЛАНЫ =====------------
1) расширение в другие комнаты (глянь еще раз методы для перемещения и нахождения пути)
2) более эффективный сбор ресурсов
3) *башни срочно*

-------       Фичи          ---------
1) в автоспавне при спавне крипа выводить в консоль только один раз только когда
кто-то строится
2) у строителей нужен код на починку. если нечего чинить значит сдвинуть их с 
источников что бы не мешались

+++++*****   ИДЕИ    *****+++++
- в атакующих формированиях попробовать тему с крипом командиром

*/